# Practicumopdrachten Week 2.2 (eerste kans)

## Dependencies importeren

Importeer in het codeblok hieronder de packages die worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
N.B.: de 2 reeds geschreven coderegels zorgen ervoor dat eventuele warnings, die code-outputs lelijker maken, uitgezet worden.

In [2]:
import warnings
warnings.simplefilter('ignore')
import sqlite3
import pandas as pd

Zet het bestand go_sales.sqlite in hetzelfde mapje als dit notebook.

## Databasetabel inlezen

Creëer een databaseconnectie met het bestand go_sales.sqlite.

In [3]:
database_connection = sqlite3.connect('go_sales.sqlite')

Gebruik de onderstaande sql_query om te achterhalen welke databasetabellen in go_sales zitten.

In [4]:
sales_staff = pd.read_sql_query("SELECT * FROM sqlite_master WHERE type='table';", database_connection)

sales_staff

,type,name,tbl_name,rootpage,sql
0,table,country,country,2,"CREATE TABLE ""country"" (""COUNTRY_CODE"" VARCHAR..."
1,table,order_details,order_details,4,"CREATE TABLE ""order_details"" (""ORDER_DETAIL_CO..."
2,table,order_header,order_header,846,"CREATE TABLE ""order_header"" (""ORDER_NUMBER"" VA..."
3,table,order_method,order_method,1072,"CREATE TABLE ""order_method"" (""ORDER_METHOD_COD..."
4,table,product,product,1074,"CREATE TABLE ""product"" (""PRODUCT_NUMBER"" VARCH..."
5,table,product_line,product_line,1086,"CREATE TABLE ""product_line"" (""PRODUCT_LINE_COD..."
6,table,product_type,product_type,1088,"CREATE TABLE ""product_type"" (""PRODUCT_TYPE_COD..."
7,table,retailer_site,retailer_site,1092,"CREATE TABLE ""retailer_site"" (""RETAILER_SITE_C..."
8,table,return_reason,return_reason,1103,"CREATE TABLE ""return_reason"" (""RETURN_REASON_C..."
9,table,returned_item,returned_item,1105,"CREATE TABLE ""returned_item"" (""RETURN_CODE"" VA..."
10,table,sales_branch,sales_branch,1133,"CREATE TABLE ""sales_branch"" (""SALES_BRANCH_COD..."
11,table,sales_staff,sales_staff,1135,"CREATE TABLE ""sales_staff"" (""SALES_STAFF_CODE""..."
12,table,SALES_TARGETData,SALES_TARGETData,1141,"CREATE TABLE ""SALES_TARGETData"" (""Id"" INTEGER ..."
13,table,sqlite_sequence,sqlite_sequence,1142,"CREATE TABLE sqlite_sequence(name,seq)"

Gebruik de gecreëerde databaseconnectie om de resultaten van de volgende query in een DataFrame te zetten:<br>
*SELECT * FROM sales_staff*

In [69]:
sales_staff = pd.read_sql_query("SELECT * FROM sales_staff", database_connection)

sales_staff

,SALES_STAFF_CODE,FIRST_NAME,LAST_NAME,POSITION_EN,WORK_PHONE,EXTENSION,FAX,EMAIL,DATE_HIRED,SALES_BRANCH_CODE,TRIAL888
0,100,Tuomas,Savolainen,Level 2 Sales Representative,+358(0)17 - 433 127,825,+358(0)17 - 433 129,TSavolainen@grtd123.com,23-7-2014,31,T
1,101,Chang-ho,Kim,Level 2 Sales Representative,82-2-778-6587,1228,82-2-778-6586,CKim@grtd123.com,15-12-2014,32,T
2,102,Jung-ho,Choi,Level 3 Sales Representative,82-2-778-6587,2641,82-2-778-6586,JChoi@grtd123.com,27-11-2014,32,T
3,103,Kwei-Ping,Kao,Level 2 Sales Representative,886-2-2975-1988,1541,886-2-2989-4978,KKwao@grtd123.com,7-10-2014,33,T
4,104,Chin-Tsai,Fang,Level 3 Sales Representative,886-2-2975-1988,2311,886-2-2989-4978,CFon@grtd123.com,8-5-2012,33,T
...,...,...,...,...,...,...,...,...,...,...,...
97,95,Tomás,Iglesias,Level 2 Sales Representative,+35 94 322 3540,325,+35 91 548 1637,TIglesias@grtd123.com,19-2-2014,29,T
98,96,Bayard,Lopes,Branch Manager,+55 (11) 344-4444,3490,+55 (11) 333-2223,BLopes@grtd123.com,12-8-2013,30,T
99,97,Viviam,Barros,Level 3 Sales Representative,+55 (11) 344-4444,3364,+55 (11) 333-2223,VBarros@grtd123.com,10-2-2017,30,T
100,98,Eduardo,Guimarães,Level 2 Sales Representative,+55 (11) 344-4444,1442,+55 (11) 333-2223,EGuimaraes@grtd123.com,14-2-2015,30,T
101,99,Helena,Lindholm,Level 3 Sales Representative,+358(0)17 - 433 127,489,+358(0)17 - 433 129,HLindholm@grtd123.com,17-8-2013,31,T

## DataFrames uitsplitsen en opbouwen met Series

De volgende 5 kolommen hebben betrekking op de contactdetails van elke medewerker in dit DataFrame:
- SALES_STAFF_CODE
- WORK_PHONE
- EXTENSION
- FAX
- EMAIL

Maak van elk van deze 5 kolommen een serie.

In [6]:
pd.Series()
sales_staff_code_series = pd.Series(sales_staff.SALES_STAFF_CODE)
work_phone_series = pd.Series(sales_staff.WORK_PHONE)
extension_series = pd.Series(sales_staff.EXTENSION)
fax_series = pd.Series(sales_staff.FAX)
email_series = pd.Series(sales_staff.EMAIL)

Zet allevijf gecreëerde series als kolommen naast elkaar in een DataFrame (*contact_details*). Gebruik pd.concat(...)<br>
Hulpvraag: welke waarde geef je aan de axis-parameter?

In [7]:
sales_staff = pd.concat([sales_staff_code_series, work_phone_series, extension_series, fax_series, email_series], axis = 1)

sales_staff

,SALES_STAFF_CODE,WORK_PHONE,EXTENSION,FAX,EMAIL
0,100,+358(0)17 - 433 127,825,+358(0)17 - 433 129,TSavolainen@grtd123.com
1,101,82-2-778-6587,1228,82-2-778-6586,CKim@grtd123.com
2,102,82-2-778-6587,2641,82-2-778-6586,JChoi@grtd123.com
3,103,886-2-2975-1988,1541,886-2-2989-4978,KKwao@grtd123.com
4,104,886-2-2975-1988,2311,886-2-2989-4978,CFon@grtd123.com
...,...,...,...,...,...
97,95,+35 94 322 3540,325,+35 91 548 1637,TIglesias@grtd123.com
98,96,+55 (11) 344-4444,3490,+55 (11) 333-2223,BLopes@grtd123.com
99,97,+55 (11) 344-4444,3364,+55 (11) 333-2223,VBarros@grtd123.com
100,98,+55 (11) 344-4444,1442,+55 (11) 333-2223,EGuimaraes@grtd123.com
101,99,+358(0)17 - 433 127,489,+358(0)17 - 433 129,HLindholm@grtd123.com

## Series en DataFrames maken vanuit lists en dictionaries

Met .head(*getal*) kan je de bovenste *getal* rijen van een tabel selecteren.<br>
Selecteer op deze manier de bovenste 5 rijen van *contact_details*.<br>
Sla dit resultaat op in een nieuw DataFrame.

In [8]:
sales_staff = pd.DataFrame(sales_staff).head(5)

sales_staff

,SALES_STAFF_CODE,WORK_PHONE,EXTENSION,FAX,EMAIL
0,100,+358(0)17 - 433 127,825,+358(0)17 - 433 129,TSavolainen@grtd123.com
1,101,82-2-778-6587,1228,82-2-778-6586,CKim@grtd123.com
2,102,82-2-778-6587,2641,82-2-778-6586,JChoi@grtd123.com
3,103,886-2-2975-1988,1541,886-2-2989-4978,KKwao@grtd123.com
4,104,886-2-2975-1988,2311,886-2-2989-4978,CFon@grtd123.com

Aan deze 10 rijen met contactdetails willen we 3 kolommen toevoegen: 'FIRST_LANGUAGE', 'SECOND_LANGUAGE' & 'THIRD_LANGUAGE'.<br>
Iedereens 'First Language' is Engels, afgekort 'EN'. Maak een lijst waarin 5x 'EN' staat.<br>
Converteer deze lijst vervolgens naar een serie en voeg deze horizontaal samen met het resultaat van de vorige opdracht.<br>
Vergeet niet een passende naam te geven aan de nieuw ontstane kolom.

In [60]:
first_language_dict = ['EN'] * 5
first_language_series = pd.Series(first_language_dict, name='FIRST_LANGUAGE')

sales_staff = pd.concat([first_language_series], axis=1)

sales_staff

  FIRST_LANGUAGE
0             EN
1             EN
2             EN
3             EN
4             EN

Maak nu de tweede kolom ('SECOND_LANGUAGE'). Maak daarvoor een dictionary, met daarin...
- Als keys: alle indexen uit het resultaat van het vorige codeblok.
- Als values: bij de eerste 3 elementen 'FR' (Frankrijk), bij de laatste 2 'DE' (Duitsland).

Maak vervolgens ook hier weer een serie van en voeg ook deze weer horizontaal samen met het rsultaat van de vorige opdracht.<br>
Vergeet niet een passende naam te geven aan de nieuw ontstane kolom.

In [61]:
second_language_dict = {0: 'FR', 1: 'FR', 2: 'FR', 3: 'DE', 4: 'DE'}
second_language_series = pd.Series(second_language_dict, name='SECOND_LANGUAGE')

sales_staff = pd.concat([first_language_series, second_language_series], axis=1)

sales_staff

  FIRST_LANGUAGE SECOND_LANGUAGE
0             EN              FR
1             EN              FR
2             EN              FR
3             EN              DE
4             EN              DE

Maak ten slotte de derde kolom ('THIRD_LANGUAGE') door een dictionary te maken met daarin...
- Als key: de naam van de nieuwe kolom. Zie je het verschil qua keys met de vorige opdracht?
- Als waarde: een lijst met daarin 'NL', 'NL', 'JPN', 'JPN', 'KOR'.

Converteer deze dictionary nu naar een DataFrame en voeg deze horizontaal samen met het resultaat van de vorige opdracht.<br>
Waarom hoef je hierna de nieuw ontstane kolom geen passende naam meer te geven?

In [62]:
third_language_dict = {'THIRD_LANGUAGE': ['NL', 'NL', 'JPN', 'JPN', 'KOR']}
third_language_df = pd.DataFrame(third_language_dict)

sales_staff = pd.concat([first_language_series, second_language_series, third_language_df], axis=1)

sales_staff

  FIRST_LANGUAGE SECOND_LANGUAGE THIRD_LANGUAGE
0             EN              FR             NL
1             EN              FR             NL
2             EN              FR            JPN
3             EN              DE            JPN
4             EN              DE            KOR

## Data toevoegen

### Rijen

Gebruik de originele databasetabel *sales_staff*.<br>
Voeg een extra rij toe met eigen invulling. Zorg ervoor dat de index netjes doorloopt.<br>
Hulpvraag: welke waarde geef je nu aan axis?

In [12]:
nieuwe_sales_staff = {'SALES_STAFF_CODE': ['1010'], 'FIRST_NAME': 'Milan', 'LAST_NAME': 'van Heijningen', 'POSITION_EN': 'Branch Manager', 'WORK_PHONE': 618756092, 'EXTENSION': 832, 'FAX': 611956077, 'EMAIL': 'hallo123@gmail.com', 'DATE_HIRED': '12-06-2015', 'SALES_BRANCH_CODE': 30, 'TRIAL888': 'T'}

sales_staff = pd.concat([sales_staff, pd.DataFrame(nieuwe_sales_staff)])

sales_staff

,FIRST_LANGUAGE,SECOND_LANGUAGE,THIRD_LANGUAGE,SALES_STAFF_CODE,FIRST_NAME,LAST_NAME,POSITION_EN,WORK_PHONE,EXTENSION,FAX,EMAIL,DATE_HIRED,SALES_BRANCH_CODE,TRIAL888
0,EN,FR,NL,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,EN,FR,NL,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,EN,FR,JPN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,EN,DE,JPN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,EN,DE,KOR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,1010,Milan,van Heijningen,Branch Manager,618756092.0,832.0,611956077.0,hallo123@gmail.com,12-06-2015,30.0,T

### Kolommen

Voeg een kolom *FULL_NAME* toe die de waarden van *FIRST_NAME* en *LAST_NAME* achter elkaar zet, gescheiden door een spatie.

In [13]:
sales_staff['FULL_NAME'] = sales_staff['FIRST_NAME'] + ' ' + sales_staff['LAST_NAME']

sales_staff

,FIRST_LANGUAGE,SECOND_LANGUAGE,THIRD_LANGUAGE,SALES_STAFF_CODE,FIRST_NAME,LAST_NAME,POSITION_EN,WORK_PHONE,EXTENSION,FAX,EMAIL,DATE_HIRED,SALES_BRANCH_CODE,TRIAL888,FULL_NAME
0,EN,FR,NL,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,EN,FR,NL,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,EN,FR,JPN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,EN,DE,JPN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,EN,DE,KOR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,1010,Milan,van Heijningen,Branch Manager,618756092.0,832.0,611956077.0,hallo123@gmail.com,12-06-2015,30.0,T,Milan van Heijningen

## Data wijzigen

### Datatypen

Door het attribuut .dtypes van een DataFrame op te vragen krijg je een serie die per kolom het datatype weergeeft. Doe dit bij de originele databasetabel *sales_staff*

In [14]:
sales_staff.dtypes

FIRST_LANGUAGE        object
SECOND_LANGUAGE       object
THIRD_LANGUAGE        object
SALES_STAFF_CODE      object
FIRST_NAME            object
LAST_NAME             object
POSITION_EN           object
WORK_PHONE           float64
EXTENSION            float64
FAX                  float64
EMAIL                 object
DATE_HIRED            object
SALES_BRANCH_CODE    float64
TRIAL888              object
FULL_NAME             object
dtype: object

Hier valt op dat elke kolom het datatype 'object' heeft: Python leest dus alles als string. Wiskundige operaties zijn hierdoor niet mogelijk.<br>
We kunnen proberen om kolommen met getallen, bijvoorbeeld de 'extension', te converteren naar een int. Zie onderstaande code.

In [15]:
sales_staff['EXTENSION'] = sales_staff['EXTENSION'].astype(int)
sales_staff.dtypes

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

Dit lukt echter niet, omdat er in de kolom 'EXTENSION' lege waarden zitten die niet geconverteerd kunnen worden naar een int.<br>
Wél kan je deze naar een float converteren, zie onderstaande code:

In [16]:
sales_staff['EXTENSION'] = sales_staff['EXTENSION'].astype(float)
sales_staff.dtypes

FIRST_LANGUAGE        object
SECOND_LANGUAGE       object
THIRD_LANGUAGE        object
SALES_STAFF_CODE      object
FIRST_NAME            object
LAST_NAME             object
POSITION_EN           object
WORK_PHONE           float64
EXTENSION            float64
FAX                  float64
EMAIL                 object
DATE_HIRED            object
SALES_BRANCH_CODE    float64
TRIAL888              object
FULL_NAME             object
dtype: object

Als we in de rij van 'EXTENSION' kijken zien we dat de conversie van het datatype nu is gelukt.<br>
Dit is <b>randvoorwaardelijk</b> voor het uitvoeren van wiskundige operaties.<br>

### Rijen

Zorg er nu voor dat bij alle extensions 1 wordt opgeteld.

In [17]:
sales_staff['EXTENSION'] = sales_staff['EXTENSION'] + 1

sales_staff['EXTENSION']

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
0    833.0
Name: EXTENSION, dtype: float64

Elke 'Branch Manager' wordt nu 'General Manager'. Schrijf code zodat deze wijziging doorgevoerd wordt in het DataFrame.

In [20]:
sales_staff['POSITION_EN'] = sales_staff['POSITION_EN'].replace('Branch Manager', 'General Manager')

sales_staff['POSITION_EN']

KeyError: 'POSITION_EN'

### Kolommen

Verander de kolomnaam 'POSITION_EN' naar 'POSITION'.

In [19]:
sales_staff = sales_staff.rename(columns={'POSITION_EN': 'POSITION'})

sales_staff

,FIRST_LANGUAGE,SECOND_LANGUAGE,THIRD_LANGUAGE,SALES_STAFF_CODE,FIRST_NAME,LAST_NAME,POSITION,WORK_PHONE,EXTENSION,FAX,EMAIL,DATE_HIRED,SALES_BRANCH_CODE,TRIAL888,FULL_NAME
0,EN,FR,NL,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,EN,FR,NL,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,EN,FR,JPN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,EN,DE,JPN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,EN,DE,KOR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,1010,Milan,van Heijningen,General Manager,618756092.0,833.0,611956077.0,hallo123@gmail.com,12-06-2015,30.0,T,Milan van Heijningen

## Data verwijderen

### Rijen

De medewerkers op indexen 99, 100 en 101 hebben helaas ontslag genomen.<br>
Verwijder de bijbehorende rijen uit het DataFrame. Gebruik slechts één keer de .drop()-methode.

In [71]:
sales_staff.drop([99,100,101])

,SALES_STAFF_CODE,FIRST_NAME,LAST_NAME,POSITION_EN,WORK_PHONE,EXTENSION,FAX,EMAIL,DATE_HIRED,SALES_BRANCH_CODE,TRIAL888
0,100,Tuomas,Savolainen,Level 2 Sales Representative,+358(0)17 - 433 127,825,+358(0)17 - 433 129,TSavolainen@grtd123.com,23-7-2014,31,T
1,101,Chang-ho,Kim,Level 2 Sales Representative,82-2-778-6587,1228,82-2-778-6586,CKim@grtd123.com,15-12-2014,32,T
2,102,Jung-ho,Choi,Level 3 Sales Representative,82-2-778-6587,2641,82-2-778-6586,JChoi@grtd123.com,27-11-2014,32,T
3,103,Kwei-Ping,Kao,Level 2 Sales Representative,886-2-2975-1988,1541,886-2-2989-4978,KKwao@grtd123.com,7-10-2014,33,T
4,104,Chin-Tsai,Fang,Level 3 Sales Representative,886-2-2975-1988,2311,886-2-2989-4978,CFon@grtd123.com,8-5-2012,33,T
...,...,...,...,...,...,...,...,...,...,...,...
94,92,Jake,Cartel,Level 2 Sales Representative,+(61) 03 2982 4242,1648,+(61) 03 2982 4243,JCartel@grtd123.com,15-12-2015,28,T
95,93,John,Sinden,Level 3 Sales Representative,+(61) 03 2982 4242,1892,+(61) 03 2982 4243,JSinden@grtd123.com,30-11-2015,28,T
96,94,Yolanda,Torres,Level 3 Sales Representative,+35 94 322 3540,125,+35 91 548 1637,YTorres@grtd123.com,29-8-2011,29,T
97,95,Tomás,Iglesias,Level 2 Sales Representative,+35 94 322 3540,325,+35 91 548 1637,TIglesias@grtd123.com,19-2-2014,29,T
98,96,Bayard,Lopes,Branch Manager,+55 (11) 344-4444,3490,+55 (11) 333-2223,BLopes@grtd123.com,12-8-2013,30,T

### Kolommen

Faxen zijn inmiddels ouderwets: niemand gebruikt zijn/haar faxnummer nog.<br>
Verwijder de bijbehorende kolom uit het DataFrame.

In [73]:
sales_staff.drop(columns='FAX')

,SALES_STAFF_CODE,FIRST_NAME,LAST_NAME,POSITION_EN,WORK_PHONE,EXTENSION,EMAIL,DATE_HIRED,SALES_BRANCH_CODE,TRIAL888
0,100,Tuomas,Savolainen,Level 2 Sales Representative,+358(0)17 - 433 127,825,TSavolainen@grtd123.com,23-7-2014,31,T
1,101,Chang-ho,Kim,Level 2 Sales Representative,82-2-778-6587,1228,CKim@grtd123.com,15-12-2014,32,T
2,102,Jung-ho,Choi,Level 3 Sales Representative,82-2-778-6587,2641,JChoi@grtd123.com,27-11-2014,32,T
3,103,Kwei-Ping,Kao,Level 2 Sales Representative,886-2-2975-1988,1541,KKwao@grtd123.com,7-10-2014,33,T
4,104,Chin-Tsai,Fang,Level 3 Sales Representative,886-2-2975-1988,2311,CFon@grtd123.com,8-5-2012,33,T
...,...,...,...,...,...,...,...,...,...,...
97,95,Tomás,Iglesias,Level 2 Sales Representative,+35 94 322 3540,325,TIglesias@grtd123.com,19-2-2014,29,T
98,96,Bayard,Lopes,Branch Manager,+55 (11) 344-4444,3490,BLopes@grtd123.com,12-8-2013,30,T
99,97,Viviam,Barros,Level 3 Sales Representative,+55 (11) 344-4444,3364,VBarros@grtd123.com,10-2-2017,30,T
100,98,Eduardo,Guimarães,Level 2 Sales Representative,+55 (11) 344-4444,1442,EGuimaraes@grtd123.com,14-2-2015,30,T
101,99,Helena,Lindholm,Level 3 Sales Representative,+358(0)17 - 433 127,489,HLindholm@grtd123.com,17-8-2013,31,T